## production: elasticache
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 18 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                     NAME                                      |
|--------|-------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_group.elasticache_queue_cache_engine_logs`                |
|        | `aws_cloudwatch_log_group.elasticache_queue_cache_slow_logs`                  |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[0]`           |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[1]`           |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[2]`           |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[0]` |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[1]` |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[2]` |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[0]`    |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[1]`    |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[2]`    |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[0]`     |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[1]`     |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[2]`     |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_medium_cpu_warning[0]`         |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_medium_cpu_warning[1]`         |
|        | `aws_cloudwatch_metric_alarm.elasticache_queue_medium_cpu_warning[2]`         |
|        | `aws_elasticache_replication_group.elasticache_queue_cache`                   |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/16302924867).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
21:07:42.305 STDOUT terraform:   + create
21:07:42.305 STDOUT terraform: Terraform will perform the following actions:
21:07:42.305 STDOUT terraform:   # aws_cloudwatch_log_group.elasticache_queue_cache_engine_logs will be created
21:07:42.306 STDOUT terraform:   + resource "aws_cloudwatch_log_group" "elasticache_queue_cache_engine_logs" {
21:07:42.306 STDOUT terraform:       + arn               = (known after apply)
21:07:42.306 STDOUT terraform:       + id                = (known after apply)
21:07:42.306 STDOUT terraform:       + log_group_class   = (known after apply)
21:07:42.306 STDOUT terraform:       + name              = "/aws/elasticache/notify-production-queue-cache/engine-logs"
21:07:42.306 STDOUT terraform:       + name_prefix       = (known after apply)
21:07:42.306 STDOUT terraform:       + retention_in_days = 0
21:07:42.306 STDOUT terraform:       + skip_destroy      = false
21:07:42.306 STDOUT terraform:       + tags_all          = (known after apply)
21:07:42.306 STDOUT terraform:     }
21:07:42.306 STDOUT terraform:   # aws_cloudwatch_log_group.elasticache_queue_cache_slow_logs will be created
21:07:42.306 STDOUT terraform:   + resource "aws_cloudwatch_log_group" "elasticache_queue_cache_slow_logs" {
21:07:42.306 STDOUT terraform:       + arn               = (known after apply)
21:07:42.306 STDOUT terraform:       + id                = (known after apply)
21:07:42.306 STDOUT terraform:       + log_group_class   = (known after apply)
21:07:42.306 STDOUT terraform:       + name              = "/aws/elasticache/notify-production-queue-cache/slow-logs"
21:07:42.306 STDOUT terraform:       + name_prefix       = (known after apply)
21:07:42.306 STDOUT terraform:       + retention_in_days = 0
21:07:42.306 STDOUT terraform:       + skip_destroy      = false
21:07:42.306 STDOUT terraform:       + tags_all          = (known after apply)
21:07:42.306 STDOUT terraform:     }
21:07:42.306 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[0] will be created
21:07:42.307 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_cpu_warning" {
21:07:42.307 STDOUT terraform:       + actions_enabled                       = true
21:07:42.307 STDOUT terraform:       + alarm_actions                         = [
21:07:42.307 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
21:07:42.307 STDOUT terraform:         ]
21:07:42.307 STDOUT terraform:       + alarm_description                     = "Average CPU of Redis ElastiCache >= 70% during 1 minute "
21:07:42.307 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-cpu-warning-CacheCluster001CPUUtilization"
21:07:42.307 STDOUT terraform:       + arn                                   = (known after apply)
21:07:42.307 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
21:07:42.307 STDOUT terraform:       + dimensions                            = {
21:07:42.307 STDOUT terraform:           + "CacheClusterId" = "notify-production-cluster-cache-az-001"
21:07:42.307 STDOUT terraform:         }
21:07:42.307 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
21:07:42.307 STDOUT terraform:       + evaluation_periods                    = 1
21:07:42.307 STDOUT terraform:       + id                                    = (known after apply)
21:07:42.307 STDOUT terraform:       + metric_name                           = "CPUUtilization"
21:07:42.307 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
21:07:42.307 STDOUT terraform:       + ok_actions                            = [
21:07:42.307 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
21:07:42.307 STDOUT terraform:         ]
21:07:42.307 STDOUT terraform:       + period                                = 60
21:07:42.307 STDOUT terraform:       + statistic                             = "Average"
21:07:42.307 STDOUT terraform:       + tags_all                              = (known after apply)
21:07:42.307 STDOUT terraform:       + threshold                             = 70
21:07:42.308 STDOUT terraform:       + treat_missing_data                    = "breaching"
21:07:42.308 STDOUT terraform:     }
21:07:42.308 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[1] will be created
21:07:42.308 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_cpu_warning" {
21:07:42.308 STDOUT terraform:       + actions_enabled                       = true
21:07:42.308 STDOUT terraform:       + alarm_actions                         = [
21:07:42.308 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
21:07:42.308 STDOUT terraform:         ]
21:07:42.308 STDOUT terraform:       + alarm_description                     = "Average CPU of Redis ElastiCache >= 70% during 1 minute "
21:07:42.308 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-cpu-warning-CacheCluster002CPUUtilization"
21:07:42.308 STDOUT terraform:       + arn                                   = (known after apply)
21:07:42.308 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
21:07:42.308 STDOUT terraform:       + dimensions                            = {
21:07:42.308 STDOUT terraform:           + "CacheClusterId" = "notify-production-cluster-cache-az-002"
21:07:42.308 STDOUT terraform:         }
21:07:42.308 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
21:07:42.308 STDOUT terraform:       + evaluation_periods                    = 1
21:07:42.308 STDOUT terraform:       + id                                    = (known after apply)
21:07:42.308 STDOUT terraform:       + metric_name                           = "CPUUtilization"
21:07:42.308 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
21:07:42.308 STDOUT terraform:       + ok_actions                            = [
21:07:42.308 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
21:07:42.308 STDOUT terraform:         ]
21:07:42.308 STDOUT terraform:       + period                                = 60
21:07:42.308 STDOUT terraform:       + statistic                             = "Average"
21:07:42.309 STDOUT terraform:       + tags_all                              = (known after apply)
21:07:42.309 STDOUT terraform:       + threshold                             = 70
21:07:42.309 STDOUT terraform:       + treat_missing_data                    = "breaching"
21:07:42.309 STDOUT terraform:     }
21:07:42.309 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[2] will be created
21:07:42.309 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_cpu_warning" {
21:07:42.309 STDOUT terraform:       + actions_enabled                       = true
21:07:42.309 STDOUT terraform:       + alarm_actions                         = [
21:07:42.309 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
21:07:42.309 STDOUT terraform:         ]
21:07:42.309 STDOUT terraform:       + alarm_description                     = "Average CPU of Redis ElastiCache >= 70% during 1 minute "
21:07:42.309 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-cpu-warning-CacheCluster003CPUUtilization"
21:07:42.309 STDOUT terraform:       + arn                                   = (known after apply)
21:07:42.309 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
21:07:42.309 STDOUT terraform:       + dimensions                            = {
21:07:42.309 STDOUT terraform:           + "CacheClusterId" = "notify-production-cluster-cache-az-003"
21:07:42.309 STDOUT terraform:         }
21:07:42.309 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
21:07:42.309 STDOUT terraform:       + evaluation_periods                    = 1
21:07:42.309 STDOUT terraform:       + id                                    = (known after apply)
21:07:42.309 STDOUT terraform:       + metric_name                           = "CPUUtilization"
21:07:42.309 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
21:07:42.309 STDOUT terraform:       + ok_actions                            = [
21:07:42.309 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
21:07:42.309 STDOUT terraform:         ]
21:07:42.309 STDOUT terraform:       + period                                = 60
21:07:42.309 STDOUT terraform:       + statistic                             = "Average"
21:07:42.309 STDOUT terraform:       + tags_all                              = (known after apply)
21:07:42.309 STDOUT terraform:       + threshold                             = 70
21:07:42.309 STDOUT terraform:       + treat_missing_data                    = "breaching"
21:07:42.309 STDOUT terraform:     }
21:07:42.310 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[0] will be created
21:07:42.310 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_connection_warning" {
21:07:42.310 STDOUT terraform:       + actions_enabled                       = true
21:07:42.310 STDOUT terraform:       + alarm_actions                         = [
21:07:42.310 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
21:07:42.310 STDOUT terraform:         ]
21:07:42.310 STDOUT terraform:       + alarm_description                     = "Average Number of Connections on Redis ElastiCache >= 1000 connections during 1 minute"
21:07:42.310 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-connection-warning-CacheCluster001"
21:07:42.310 STDOUT terraform:       + arn                                   = (known after apply)
21:07:42.310 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
21:07:42.310 STDOUT terraform:       + dimensions                            = {
21:07:42.310 STDOUT terraform:           + "CacheClusterId" = "notify-production-cluster-cache-az-001"
21:07:42.310 STDOUT terraform:         }
21:07:42.310 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
21:07:42.310 STDOUT terraform:       + evaluation_periods                    = 1
21:07:42.310 STDOUT terraform:       + id                                    = (known after apply)
21:07:42.310 STDOUT terraform:       + metric_name                           = "CurrConnections"
21:07:42.310 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
21:07:42.310 STDOUT terraform:       + ok_actions                            = [
21:07:42.310 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
21:07:42.310 STDOUT terraform:         ]
21:07:42.310 STDOUT terraform:       + period                                = 60
21:07:42.310 STDOUT terraform:       + statistic                             = "Average"
21:07:42.310 STDOUT terraform:       + tags_all                              = (known after apply)
21:07:42.310 STDOUT terraform:       + threshold                             = 1000
21:07:42.310 STDOUT terraform:       + treat_missing_data                    = "missing"
21:07:42.310 STDOUT terraform:     }
21:07:42.310 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[1] will be created
21:07:42.310 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_connection_warning" {
21:07:42.310 STDOUT terraform:       + actions_enabled                       = true
21:07:42.310 STDOUT terraform:       + alarm_actions                         = [
21:07:42.310 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
21:07:42.311 STDOUT terraform:         ]
21:07:42.311 STDOUT terraform:       + alarm_description                     = "Average Number of Connections on Redis ElastiCache >= 1000 connections during 1 minute"
21:07:42.311 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-connection-warning-CacheCluster002"
21:07:42.311 STDOUT terraform:       + arn                                   = (known after apply)
21:07:42.311 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
21:07:42.311 STDOUT terraform:       + dimensions                            = {
21:07:42.311 STDOUT terraform:           + "CacheClusterId" = "notify-production-cluster-cache-az-002"
21:07:42.311 STDOUT terraform:         }
21:07:42.311 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
21:07:42.311 STDOUT terraform:       + evaluation_periods                    = 1
21:07:42.311 STDOUT terraform:       + id                                    = (known after apply)
21:07:42.311 STDOUT terraform:       + metric_name                           = "CurrConnections"
21:07:42.311 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
21:07:42.311 STDOUT terraform:       + ok_actions                            = [
21:07:42.311 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
21:07:42.311 STDOUT terraform:         ]
21:07:42.311 STDOUT terraform:       + period                                = 60
21:07:42.311 STDOUT terraform:       + statistic                             = "Average"
21:07:42.311 STDOUT terraform:       + tags_all                              = (known after apply)
21:07:42.311 STDOUT terraform:       + threshold                             = 1000
21:07:42.311 STDOUT terraform:       + treat_missing_data                    = "missing"
21:07:42.311 STDOUT terraform:     }
21:07:42.311 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[2] will be created
21:07:42.311 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_connection_warning" {
21:07:42.311 STDOUT terraform:       + actions_enabled                       = true
21:07:42.311 STDOUT terraform:       + alarm_actions                         = [
21:07:42.311 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
21:07:42.311 STDOUT terraform:         ]
21:07:42.311 STDOUT terraform:       + alarm_description                     = "Average Number of Connections on Redis ElastiCache >= 1000 connections during 1 minute"
21:07:42.311 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-connection-warning-CacheCluster003"
21:07:42.311 STDOUT terraform:       + arn                                   = (known after apply)
21:07:42.311 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
21:07:42.311 STDOUT terraform:       + dimensions                            = {
21:07:42.312 STDOUT terraform:           + "CacheClusterId" = "notify-production-cluster-cache-az-003"
21:07:42.312 STDOUT terraform:         }
21:07:42.312 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
21:07:42.312 STDOUT terraform:       + evaluation_periods                    = 1
21:07:42.312 STDOUT terraform:       + id                                    = (known after apply)
21:07:42.312 STDOUT terraform:       + metric_name                           = "CurrConnections"
21:07:42.312 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
21:07:42.312 STDOUT terraform:       + ok_actions                            = [
21:07:42.312 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
21:07:42.312 STDOUT terraform:         ]
21:07:42.312 STDOUT terraform:       + period                                = 60
21:07:42.312 STDOUT terraform:       + statistic                             = "Average"
21:07:42.312 STDOUT terraform:       + tags_all                              = (known after apply)
21:07:42.312 STDOUT terraform:       + threshold                             = 1000
21:07:42.312 STDOUT terraform:       + treat_missing_data                    = "missing"
21:07:42.312 STDOUT terraform:     }
21:07:42.312 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[0] will be created
21:07:42.312 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_critical" {
21:07:42.312 STDOUT terraform:       + actions_enabled                       = true
21:07:42.312 STDOUT terraform:       + alarm_actions                         = [
21:07:42.312 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
21:07:42.312 STDOUT terraform:         ]
21:07:42.312 STDOUT terraform:       + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 85% during 1 minute"
21:07:42.312 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-db-memory-critical-CacheCluster001"
21:07:42.312 STDOUT terraform:       + arn                                   = (known after apply)
21:07:42.312 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
21:07:42.312 STDOUT terraform:       + dimensions                            = {
21:07:42.312 STDOUT terraform:           + "CacheClusterId" = "notify-production-cluster-cache-az-001"
21:07:42.312 STDOUT terraform:         }
21:07:42.312 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
21:07:42.312 STDOUT terraform:       + evaluation_periods                    = 1
21:07:42.312 STDOUT terraform:       + id                                    = (known after apply)
21:07:42.312 STDOUT terraform:       + metric_name                           = "DatabaseMemoryUsagePercentage"
21:07:42.312 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
21:07:42.312 STDOUT terraform:       + ok_actions                            = [
21:07:42.312 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
21:07:42.313 STDOUT terraform:         ]
21:07:42.313 STDOUT terraform:       + period                                = 60
21:07:42.313 STDOUT terraform:       + statistic                             = "Average"
21:07:42.313 STDOUT terraform:       + tags_all                              = (known after apply)
21:07:42.313 STDOUT terraform:       + threshold                             = 85
21:07:42.313 STDOUT terraform:       + treat_missing_data                    = "missing"
21:07:42.313 STDOUT terraform:     }
21:07:42.313 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[1] will be created
21:07:42.313 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_critical" {
21:07:42.313 STDOUT terraform:       + actions_enabled                       = true
21:07:42.313 STDOUT terraform:       + alarm_actions                         = [
21:07:42.313 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
21:07:42.313 STDOUT terraform:         ]
21:07:42.313 STDOUT terraform:       + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 85% during 1 minute"
21:07:42.313 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-db-memory-critical-CacheCluster002"
21:07:42.313 STDOUT terraform:       + arn                                   = (known after apply)
21:07:42.313 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
21:07:42.313 STDOUT terraform:       + dimensions                            = {
21:07:42.313 STDOUT terraform:           + "CacheClusterId" = "notify-production-cluster-cache-az-002"
21:07:42.313 STDOUT terraform:         }
21:07:42.313 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
21:07:42.313 STDOUT terraform:       + evaluation_periods                    = 1
21:07:42.313 STDOUT terraform:       + id                                    = (known after apply)
21:07:42.313 STDOUT terraform:       + metric_name                           = "DatabaseMemoryUsagePercentage"
21:07:42.313 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
21:07:42.313 STDOUT terraform:       + ok_actions                            = [
21:07:42.313 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
21:07:42.313 STDOUT terraform:         ]
21:07:42.313 STDOUT terraform:       + period                                = 60
21:07:42.313 STDOUT terraform:       + statistic                             = "Average"
21:07:42.313 STDOUT terraform:       + tags_all                              = (known after apply)
21:07:42.313 STDOUT terraform:       + threshold                             = 85
21:07:42.313 STDOUT terraform:       + treat_missing_data                    = "missing"
21:07:42.313 STDOUT terraform:     }
21:07:42.313 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[2] will be created
21:07:42.313 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_critical" {
21:07:42.313 STDOUT terraform:       + actions_enabled                       = true
21:07:42.314 STDOUT terraform:       + alarm_actions                         = [
21:07:42.314 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
21:07:42.314 STDOUT terraform:         ]
21:07:42.314 STDOUT terraform:       + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 85% during 1 minute"
21:07:42.314 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-db-memory-critical-CacheCluster003"
21:07:42.314 STDOUT terraform:       + arn                                   = (known after apply)
21:07:42.314 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
21:07:42.314 STDOUT terraform:       + dimensions                            = {
21:07:42.314 STDOUT terraform:           + "CacheClusterId" = "notify-production-cluster-cache-az-003"
21:07:42.314 STDOUT terraform:         }
21:07:42.314 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
21:07:42.314 STDOUT terraform:       + evaluation_periods                    = 1
21:07:42.314 STDOUT terraform:       + id                                    = (known after apply)
21:07:42.314 STDOUT terraform:       + metric_name                           = "DatabaseMemoryUsagePercentage"
21:07:42.314 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
21:07:42.314 STDOUT terraform:       + ok_actions                            = [
21:07:42.314 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
21:07:42.314 STDOUT terraform:         ]
21:07:42.314 STDOUT terraform:       + period                                = 60
21:07:42.314 STDOUT terraform:       + statistic                             = "Average"
21:07:42.314 STDOUT terraform:       + tags_all                              = (known after apply)
21:07:42.314 STDOUT terraform:       + threshold                             = 85
21:07:42.314 STDOUT terraform:       + treat_missing_data                    = "missing"
21:07:42.314 STDOUT terraform:     }
21:07:42.314 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[0] will be created
21:07:42.314 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_warning" {
21:07:42.314 STDOUT terraform:       + actions_enabled                       = true
21:07:42.314 STDOUT terraform:       + alarm_actions                         = [
21:07:42.314 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
21:07:42.314 STDOUT terraform:         ]
21:07:42.314 STDOUT terraform:       + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 60% during 1 minute"
21:07:42.314 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-db-memory-warning-CacheCluster001"
21:07:42.314 STDOUT terraform:       + arn                                   = (known after apply)
21:07:42.314 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
21:07:42.314 STDOUT terraform:       + dimensions                            = {
21:07:42.315 STDOUT terraform:           + "CacheClusterId" = "notify-production-cluster-cache-az-001"
21:07:42.315 STDOUT terraform:         }
21:07:42.315 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
21:07:42.315 STDOUT terraform:       + evaluation_periods                    = 1
21:07:42.315 STDOUT terraform:       + id                                    = (known after apply)
21:07:42.315 STDOUT terraform:       + metric_name                           = "DatabaseMemoryUsagePercentage"
21:07:42.315 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
21:07:42.315 STDOUT terraform:       + ok_actions                            = [
21:07:42.315 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
21:07:42.315 STDOUT terraform:         ]
21:07:42.315 STDOUT terraform:       + period                                = 60
21:07:42.315 STDOUT terraform:       + statistic                             = "Average"
21:07:42.315 STDOUT terraform:       + tags_all                              = (known after apply)
21:07:42.315 STDOUT terraform:       + threshold                             = 60
21:07:42.315 STDOUT terraform:       + treat_missing_data                    = "missing"
21:07:42.315 STDOUT terraform:     }
21:07:42.315 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[1] will be created
21:07:42.315 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_warning" {
21:07:42.315 STDOUT terraform:       + actions_enabled                       = true
21:07:42.315 STDOUT terraform:       + alarm_actions                         = [
21:07:42.315 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
21:07:42.315 STDOUT terraform:         ]
21:07:42.315 STDOUT terraform:       + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 60% during 1 minute"
21:07:42.315 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-db-memory-warning-CacheCluster002"
21:07:42.315 STDOUT terraform:       + arn                                   = (known after apply)
21:07:42.315 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
21:07:42.315 STDOUT terraform:       + dimensions                            = {
21:07:42.315 STDOUT terraform:           + "CacheClusterId" = "notify-production-cluster-cache-az-002"
21:07:42.315 STDOUT terraform:         }
21:07:42.315 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
21:07:42.315 STDOUT terraform:       + evaluation_periods                    = 1
21:07:42.315 STDOUT terraform:       + id                                    = (known after apply)
21:07:42.315 STDOUT terraform:       + metric_name                           = "DatabaseMemoryUsagePercentage"
21:07:42.315 STDOUT terraform:       + namespace                             = "AWS/ElastiCache"
21:07:42.315 STDOUT terraform:       + ok_actions                            = [
21:07:42.315 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
21:07:42.316 STDOUT terraform:         ]
21:07:42.316 STDOUT terraform:       + period                                = 60
21:07:42.316 STDOUT terraform:       + statistic                             = "Average"
21:07:42.316 STDOUT terraform:       + tags_all                              = (known after apply)
21:07:42.316 STDOUT terraform:       + threshold                             = 60
21:07:42.316 STDOUT terraform:       + treat_missing_data                    = "missing"
21:07:42.316 STDOUT terraform:     }
21:07:42.316 STDOUT terraform:   # aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[2] will be created
21:07:42.316 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "elasticache_queue_high_db_memory_warning" {
21:07:42.316 STDOUT terraform:       + actions_enabled                       = true
21:07:42.316 STDOUT terraform:       + alarm_actions                         = [
21:07:42.316 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
21:07:42.316 STDOUT terraform:         ]
21:07:42.316 STDOUT terraform:       + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 60% during 1 minute"
21:07:42.316 STDOUT terraform:       + alarm_name                            = "elasticache-queue-high-db-memory-warning-CacheCluster003"
21:07:42.316 STDOUT terraform:       + arn                                   = (known after apply)
21:07:42.316 STDOUT terraform:       + comparison_operator                   = "GreaterThanOrEqualToThreshold"
21:07:42.316 STDOUT terraform:       + dimensions        ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.elasticache_queue_cache_engine_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.elasticache_queue_cache_slow_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-elasticache-engine-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-elasticache-slow-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.redis-batch-saving"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_cpu_warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_connection_warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_critical[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.elasticache_queue_high_db_memory_warning[1]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
